Repository: 84000/data-translation-memory
Catalog: toh555-v3.tmx
Source language: bo
Languages: en

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་ཀྱི་ཤིང་གི་ལྷ་མོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རིགས་ཀྱི་ལྷ་མོ་ཁྱོད་ཀྱིས་འདི་ལྟར་ཤེས་པར་བྱ་སྟེ། སྔོན་བྱུང་བ་ཚོང་དཔོན་གྱི་བུ་ཆུ་འབེབས་ཞེས་བྱ་བ་དེ་ནི་ང་ཉིད་ཡིན་ནོ།
en: Then the Bhagavat said to the goddess of the Bodhi tree, “Noble goddess, know this: I was Jalavāhana, the head merchant’s son in the past.

source: །ཚོང་དཔོན་ཆུ་འཛིན་ཅེས་བྱ་བ་དེ་ནི་མཛེས་པའི་ཏོག་ཡིན་ནོ།
en: Ruciraketu was the head merchant Jaladhara.

source: །དེའི་བུ་གཉིས་ལས་བུ་ཆེན་པོ་ཆུ་རྒྱས་ཞེས་བྱ་བ་དེ་ནི་དངུལ་གྱི་ཏོག་ཅེས་བྱ་བ་འདི་ཉིད་དོ།
en: Rūpyaketu was his older son, Jalāmbara.

source: །དེའི་བུ་ཆུང་ངུ་ཆུའི་མཛོད་ཅེས་བྱ་བ་དེ་ནི་དངུལ་གྱི་འོད་ཅེས་བྱ་བ་འདི་ཉིད་ཡིན་ནོ།
en: Rūpyaprabha was his younger son, Jalagarbha.

source: །རྒྱལ་པོ་ལྷའི་དབང་ཕྱུག་གི་འོད་ཅེས་བྱ་བ་དེ་ནི་བྱང་ཆུབ་ཀྱི་ཤིང་གི་ལྷ་མོ་ཁྱོད་ཉིད་ཡིན་ནོ།
en: You, the goddess of the Bodhi tree, were King Sureśvaraprabha.

source: །ཉ་སྟོང་ཕྲག་བཅུ་པོ་དེ་དག་ནི་ལྷའི་བུ་སྟོང་ཕྲག་བཅུ་པོ་འདི་ཉིད་ཡིན་ནོ།
en: The ten thousand fish were these ten thousand devas.

source: །ངས་སྔོན་ཉ་དེ་དག་ལ་ཆུ་དང་ཟས་བྱིན་ཏེ་ཚིམ་པར་བྱས་ནས་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་ཡན་ལག་བཅུ་གཉིས་པའི་ཆོས་ཟབ་མོ་དང་མཚུངས་པར་ལྡན་པའི་གཟུངས་འདི་བཤད་པའི་རྒྱུ་དེ་དང་།
en: In the past, I satisfied those fish with water and food and then taught them this dhāraṇī that is the same as the profound Dharma of the twelve phases of dependent origination.

source: གཞན་ཡང་དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་གཙུག་ཕུད་དེའི་མཚན་ནས་བརྗོད་དེ་བསྟན་པའི་དགེ་བའི་རྩ་བ་དེའི་རྒྱུས་མཐོ་རིས་སུ་སྐྱེས་པར་གྱུར་པས། དེང་ངའི་ཐད་དུ་འོངས་ནས་རབ་ཏུ་དགའ་བས་ཆོས་མཉན་པས་ངས་ཐམས་ཅད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་ནས་དེ་དག་གི་མིང་བསྟན་པ་ཡིན་ནོ།
en: I also recited and taught them the name of the Tathāgata Ratnaśikhin. It is through those good roots as causes that they were reborn in a higher existence so that today they have come before me and listened to the Dharma with joy and I have revealed to them the prophecy of their highest, most complete enlightenment and revealed to them what their names will be. “

source: །རིགས་ཀྱི་ལྷ་མོ་ཇི་ལྟར་ངས་སྔོན་སྲིད་པ་རྣམས་སུ་འཁོར་བ་ན་འཁོར་བའི་ཚེ་སེམས་ཅན་ཚད་མེད་པ་སྙེད་ལ་རྒྱ་ཆེར་ཕན་བཏགས་ནས་ཐམས་ཅད་རིམ་གྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པ་དེ་བཞིན་དུ་ཁྱེད་ཅག་ཐམས་ཅད་ཀྱིས་ཀྱང་ནན་ཏན་བརྩོན་འགྲུས་ཀྱིས་ངེས་པར་འབྱུང་བ་ཡོངས་སུ་གཉེར་ནས། བག་མེད་པར་མི་བྱའོ།
en: Noble goddess, in my previous existences, while I was continuing through saṃsāra, I benefited countless, vast numbers of beings and eventually revealed to them the prophecies of their highest, most complete enlightenment. In that same way, all of you should with diligence and dedication seek to set forth from saṃsāra and not be inattentive.”

source: །དེ་ནས་འཁོར་མང་པོ་རྣམས་དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་ཐོས་པ་དང་། ཐམས་ཅད་ཀྱིས་བྱམས་པ་དང་། སྙིང་རྗེ་ཆེན་པོས་ཐམས་ཅད་ཡོངས་སུ་སྐྱོ་བ་དང་། ནན་ཏན་བརྩོན་འགྲུས་ཀྱི་དཀའ་བ་སྤྱད་ནས།
en: Then all of that great assembly, having heard those words, understood that they should, with great love and compassion, become disillusioned with all saṃsāra, and with diligence and dedication undergo hardships and subsequently realize and manifest the highest enlightenment.

source: གདོད་བླ་ན་མེད་པའི་བྱང་ཆུབ་རྟོགས་ཤིང་མངོན་དུ་བྱེད་པར་འགྱུར་བར་ཁོང་དུ་ཆུད་པར་གྱུར་པས་ཤིན་ཏུ་དང་བའི་སེམས་ཀྱིས་མངོན་པར་ཡིད་ཆེས་ཤིང་རབ་ཏུ་དགའ་བར་གྱུར་ཏོ།
en: With trusting minds they had complete certainty of this and were overjoyed.

source: །གསེར་འོད་དམ་པ་མཆོག་ཏུ་རྣམ་པར་རྒྱལ་བ་མདོ་སྡེའི་རྒྱལ་པོ་ལས་ཚོང་དཔོན་གྱི་བུ་ཆུ་འབེབས་ཀྱི་ལེའུ་སྟེ་ཉི་ཤུ་ལྔ་པའོ།། །།གསེར་འོད་དམ་པ་མཆོག་ཏུ་རྣམ་པར་རྒྱལ་བ་མདོ་སྡེའི་རྒྱལ་པོ།
en: This concludes “Jalavāhana, the Head Merchant’s Son,” the twenty-fifth chapter of “The Supremely Victorious King of Sūtras, the Sublime Golden Light.”

source: བམ་པོ་བཅུ་པ་སྟེ་ཐ་མ། དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་འཁོར་མང་པོ་རྣམས་ལ་ལྷའི་བུ་སྟོང་ཕྲག་བཅུ་པོ་དེ་དག་གི་སྔོན་གྱི་རྒྱུ་དང་རྐྱེན་བཀས་བཤད་ནས། ཡང་བྱང་ཆུབ་ཀྱི་ཤིང་གི་ལྷ་མོ་དང་འཁོར་མང་པོ་རྣམས་ལ་བཀའ་སྩལ་པ། ངས་འདས་པའི་དུས་ཀྱི་ཚེ་བྱང་ཆུབ་སེམས་དཔའི་ལམ་སྤྱོད་པ་ན་ཆུ་དང་ཟས་སྦྱིན་པ་བཏང་ནས་ཉ་དེ་དག་གི་སྲོག་ལ་ཕན་བཏགས་པ་འབའ་ཞིག་བྱས་པ་མ་ཡིན་གྱི། ཤིན་ཏུ་ཕངས་པའི་ལུས་ཀྱང་ཡོངས་སུ་བཏང་སྟེ།
en: Chapter 26: Giving Away the Body Then the Bhagavat, having taught that past cause and condition to the great assembly and those ten thousand devas, spoke again to the goddess of the Bodhi tree and that great assembly: “In the past, while I was practicing the path of the bodhisattva, I did not just give water and food to save the lives of those fish; I also gave away my cherished body.

source: དེའི་རྒྱུ་དང་རྐྱེན་གང་ཡིན་པ་ལྷན་ཅིག་བལྟ་བར་བྱའོ།
en: Regard together the cause and condition for that!”

source: །དེ་ནས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ལྷའི་གནས་ཀྱི་སྟེང་དང་། ལྷའི་གནས་ཀྱི་འོག་ཐམས་ཅད་ན་མཆོག་ཏུ་རྣམ་པར་རྒྱལ་བ། མཆོག་ཏུ་བཙུན་པ། འོད་ཟེར་བརྒྱ་སྟོང་དུ་མས་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་གསལ་བར་མཛད་པ། མཁྱེན་པ་ཐམས་ཅད་ཕུན་སུམ་ཚོགས་པར་གྱུར་པ།
en: Then the Tathāgata Arhat Samyaksaṃbuddha, who was supremely victorious and supremely venerable everywhere both above the paradises and below the paradises, who illuminated the world realms in ten directions with many hundreds of thousands of light rays, who had perfect omniscience, who had the completion of good qualities, went together with the great assembly to the Pañcala land.

source: ཡོན་ཏན་ཡོངས་སུ་རྫོགས་པར་གྱུར་པ་དེས་དགེ་སློང་རྣམས་དང་། འཁོར་མང་པོ་རྣམས་དང་ཐབས་ཅིག་ཏུ་པཉྩ་ལའི་ལྗོངས་སུ་བྱོན་ནས། ནགས་ཚལ་ས་གཞི་ཤིན་ཏུ་མཉམ་ལ་ཚེར་མ་རྣམས་མེད་པ་མེ་ཏོག་མཆོག་དམ་པ་དང་རྩྭ་འཇམ་པོ་དག་གིས་ཀུན་དུ་ཁྱབ་པར་བཀྲམ་པར་གཤེགས་ཏེ།
en: They came to a forest that had level ground, was free of thorns, and was spread throughout with excellent flowers and soft grass.

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ། ཁྱོད་ཀྱིས་ཤིང་འདིའི་དྲུང་དུ་ངའི་ཆེད་དུ་སྟན་ཐིང་ཤིག །
en: The Bhagavat said to Venerable Ānanda, “Ānanda, prepare a seat for me beneath that tree.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་བཀའ་མཉན་ནས་གདན་བཏིང་ངོ་།
en: Then Venerable Ānanda, obeying that command, prepared a seat.

source: །བཏིང་ཟིན་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: When it was prepared, he said to the Bhagavat, “Bhagavat, the seat is prepared.

source: །བཅོམ་ལྡན་འདས་གདན་བཤམས་ལགས་ན་འཕགས་པས་དུས་མཁྱེན་པར་མཛད་དུ་གསོལ།
en: I request that you, Ārya, know that it is ready.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་གདན་གྱི་སྟེང་དུ་སྐྱིལ་མོ་ཀྲུང་བཅས་ཏེ་སྐུ་དྲང་པོར་བསྲང་ནས།
en: The Bhagavat sat cross-legged upon the seat, with his body upright, remaining in true mindfulness.

source: ཡང་དག་པའི་དྲན་པ་ཉེ་བར་བཞག་སྟེ་བཞུགས་ནས་དགེ་སློང་རྣམས་ལ་བཀའ་སྩལ་པ། ཁྱེད་ཅག་སྔོན་དཀའ་བ་སྤྱད་པའི་བྱང་ཆུབ་སེམས་དཔའི་སྔོན་གྱི་ལུས་ཀྱི་རིང་བསྲེལ་བལྟ་བར་འདོད་དམ།
en: Being seated, he asked the bhikṣus, “Do you want to view the relics of the body of a bodhisattva who accomplished a difficult act in the past?” “

source: དགེ་སློང་རྣམས་ཀྱིས་གསོལ་བ། བདག་ཅག་མཐོང་བར་མོས་ལགས་སོ།
en: We do wish to see them,” said the bhikṣus.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་བསོད་ནམས་བརྒྱས་རབ་ཏུ་བརྒྱན་པ། མཚན་དང་དཔེ་བྱད་དང་ལྡན་པའི་ཕྱག་གིས་ས་ལ་བསྣུན་པ་དང་།
en: The Bhagavat then pressed down on the ground with his hand, which was adorned with a hundred merits and possessed the signs and features of a great being.

source: དེའི་ཚེ་ས་ཆེན་པོ་རྣམ་པ་དྲུག་ཏུ་རབ་ཏུ་གཡོས་པར་གྱུར་པས་ས་གས་ཤིང་བྱེ་བར་གྱུར་པ་དང་། རིན་པོ་ཆེ་སྣ་བདུན་གྱི་མཆོད་རྟེན་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་དྲ་བས་རབ་ཏུ་བརྒྱན་པ་ཞིག་མངོན་པར་འཕགས་ཏེ་བྱུང་བ་འཁོར་མང་པོ་ཀུན་གྱིས་མཐོང་ནས་ངོ་མཚར་ཆེ་བའི་བསམ་པ་སྐྱེས་པར་གྱུར་ཏོ།
en: At that moment, the great earth shook in six ways, the ground split and divided, and the great assembly saw a stūpa made of the seven precious materials and adorned by a net of various jewels appearing, rising up from the ground, and they had thoughts of great astonishment.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་གདན་ལས་བཞེངས་ཏེ། ཕྱག་མཛད་ནས་གཡས་ཕྱོགས་སུ་བསྐོར་བ་མཛད་དེ་སླར་གདན་ལ་བཞུགས་ནས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ། ཁྱོད་ཀྱིས་མཆོད་རྟེན་འདིའི་སྒོ་ཕྱེ་ཤིག །
en: The Bhagavat then rose from his seat, bowed down to it, circumambulated it, and then again sat upon his seat and said to Ānanda, “You, open the door of this stūpa!”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་སྒོ་དེ་ཕྱེ་སྟེ། རིན་པོ་ཆེ་སྣ་བདུན་ལས་བྱས་པའི་སྒྲོམ་བུ་རིན་པོ་ཆེ་མཆོག་དམ་པས་བརྒྱན་པ་ཞིག་མཐོང་བ་དང་།
en: Then Venerable Ānanda opened the door and saw a casket made of the seven precious materials and adorned by excellent, perfect jewels.

source: བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་རིན་པོ་ཆེ་སྣ་བདུན་ལས་བགྱིས་པའི་སྒྲོམ་བུ་རིན་པོ་ཆེ་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་རབ་ཏུ་བརྒྱན་པ་ཞིག་གདའ་ལགས་སོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: He said to the Bhagavat, “Bhagavat, there is a casket made of the seven precious materials and adorned by various jewels.” “

source: ཁྱོད་ཀྱིས་སྒྲོམ་ཕྱེ་ཤིག་དེ་ནས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་བཀའ་མཉན་ནས་ཕྱེ་བ་དང་རིང་བསྲེལ་ཁ་དོག་དུང་དང་མེ་ཏོག་ཀུ་མུ་ད་འདྲ་བ་ཞིག་མཐོང་ནས་བཅོམ་ལྡན་འདས་ལ་གསོལ་བ།
en: You, open the casket,” said the Bhagavat. Then Venerable Ānanda, obeying the command, opened it and saw inside relics that had a color like that of conches and white water lilies.

source: སྒྲོམ་གྱི་ནང་ན་རིང་བསྲེལ་ཁ་དོག་དམ་པ་གཞན་ལས་ཁྱད་པར་དུ་འཕགས་པ་ཞིག་གདའ་ལགས་སོ།
en: He said to the Bhagavat, “Inside the casket there are relics with a sublime color, superior to any other.” “

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་ཁྱོད་ཀྱིས་སྐྱེས་བུ་ཆེན་པོའི་རུས་པ་འདིར་ཁྱེར་ཏེ་ཤོག་ཤིག །
en: Ānanda, come and bring those bones of a great being here!” said the Bhagavat.

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་རིང་བསྲེལ་དེ་བླངས་ནས་བཅོམ་ལྡན་འདས་ལ་ཕུལ་ལོ།
en: Venerable Ānanda then picked up those relics and gave them to the Bhagavat.

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཞེས་ནས་དགེ་སློང་རྣམས་ལ་ཁྱེད་ཀྱིས་དཀའ་བ་སྤྱད་པའི་བྱང་ཆུབ་སེམས་དཔའ་ལུས་ཀྱི་རིང་བསྲེལ་བཞག་པ་ལ་ལྟོས་ཤིག་ཅེས་བཀའ་སྩལ་ནས་ཚིགས་སུ་བཅད་དེ་བཀའ་སྩལ་པ། བྱང་ཆུབ་སེམས་དཔའ་ཡོན་ཏན་མཆོག་ལྡན་བློ།
en: The Bhagavat took them and said to the bhikṣus, “Behold the relics of the body of a bodhisattva who accomplished a difficult act,” and then he recited this verse: “The bodhisattva has a mind with perfect qualities.

source: །རབ་དཔའ་བརྩོན་པས་ཕ་རོལ་ཕྱིན་དྲུག་རྫོགས། །རྟག་སྒོམ་བྱང་ཆུབ་ཕྱིར་ནི་རྒྱུན་འཆད་མེད། །བཏང་སྙོམས་ཆེ་བསྟན་སེམས་ལ་ངལ་བ་མེད།
en: Courageous, he diligently completes the six perfections, Constantly meditating uninterruptedly for the sake of enlightenment, With stable, great equanimity, with a mind that never wearies. “

source: །དགེ་སློང་དག་ཁྱེད་ཅག་ཐམས་ཅད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའི་སྔོན་གྱི་ལུས་ཀྱི་རིང་བསྲེལ་ལ་གུས་པས་ཕྱག་བྱོས་ཤིག །
en: Bhikṣus, you must all pay homage with veneration to the relics of the past body of the bodhisattva.

source: རིང་བསྲེལ་འདི་ནི་ཚུལ་ཁྲིམས་དང་། ཏིང་ངེ་འཛིན་དང་། ཤེས་རབ་ཀྱི་དྲི་ཚད་མེད་པ་དག་གིས་ཡོངས་སུ་བདུགས་པ།
en: These relics are perfumed by the measureless aroma of correct conduct, samādhi, and wisdom.

source: བསོད་ནམས་ཀྱི་ཞིང་མཆོག་དམ་པ་ཡིན་པས་ཤིན་ཏུ་ཕྲད་པར་དཀའོ།
en: They are an excellent, supreme field of merit and are extremely difficult to encounter.”

source: །དེ་ནས་དགེ་སློང་རྣམས་དང་། འཁོར་མང་པོ་རྣམས་ཀྱིས་སེམས་རྩེ་གཅིག་ཏུ་གུས་པས་ཐལ་མོ་སྦྱར་ཏེ་མགོ་བོས་རིང་བསྲེལ་ལ་ཕྱག་བྱས་ནས། སྔོན་ཆད་ནམ་ཡང་དེ་ལྟ་བུ་མ་བྱུང་ངོ་ཞེས་བསྔགས་པ་བརྗོད་པར་གྱུར་ཏོ།
en: The bhikṣus and that great assembly then single-mindedly and reverently placed their palms together and bowed down their heads in homage to those relics and praised them, saying, “Never has such a thing occurred before!”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་མདུན་དུ་འཕགས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་ཕྱག་བྱས་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྟོན་པ་ཆེན་པོ་ནི་ཐམས་ཅད་ལས་མངོན་པར་འཕགས་པ་ལགས་པས་སེམས་ཅན་ཀུན་གྱིས་བསྙེན་བཀུར་བགྱི་བ་ལགས་ན།
en: Then Venerable Ānanda rose before the Bhagavat, bowed down to his feet, and said to the Bhagavat, “The Bhagavat, the Tathāgata, the great teacher, is superior to all, so that all beings honor him.

source: རྒྱུ་དང་རྐྱེན་གང་གི་སླད་དུ་ལུས་ཀྱི་རུས་པ་འདི་ལ་ཕྱག་མཛད་ལགས།
en: Therefore, what is the cause and condition whereby he pays homage to these bones of a body?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་ང་ནི་རུས་པ་འདིའི་རྒྱུས་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པར་གྱུར་པས་སྔོན་གྱི་དྲིན་བསབ་པའི་ཕྱིར་དེང་ངས་ཕྱག་བྱས་པ་ཡིན་ནོ།
en: The Bhagavat said to Venerable Ānanda, “Ānanda, it is because of these bones that I quickly attained the highest, most complete enlightenment of perfect buddhahood. Therefore, in order to repay their kindness, I have today paid homage to them.”

source: །ཡང་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ། ངས་དེང་ཁྱོད་དང་འཁོར་མང་པོའི་ཐེ་ཙོམ་དང་སོམ་ཉི་བཅད་པའི་ཕྱིར་རིང་བསྲེལ་འདིའི་སྔོན་གྱི་རྒྱུ་དང་རྐྱེན་གང་ཡིན་པ་ཡང་དག་པར་བཤད་ཀྱིས་ཁྱེད་ཅག་ལེགས་པར་ཡིད་ལ་བྱོས་ལ་སེམས་རྩེ་གཅིག་ཏུ་ཉོན་ཅིག །
en: Then he also said to Venerable Ānanda, “Today, in order to dispel the doubt and uncertainty that you and the great assembly have, I will explain perfectly the past causes and conditions of these relics, and therefore you must pay close attention and listen single-mindedly!” “

source: ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་གསོལ་བ། བདག་ཅག་ཤིན་ཏུ་ཐོས་པར་མོས་ལགས་ན་རྣམ་པར་ཕྱེ་སྟེ་བཀས་བཤད་དུ་གསོལ།
en: We strongly wish to hear it, so therefore we request that you teach and explain,” said Venerable Ānanda. “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་སྔོན་བྱུང་བ་འདས་པའི་དུས་ཀྱི་ཚེ་ཡུལ་གཅིག་གི་རྒྱལ་པོ་ཤིང་རྟ་ཆེན་པོ་ཞེས་བྱ་བ་ཤིན་ཏུ་ཕྱུག་ཅིང་ནོར་མང་བ།
en: Ānanda,” replied the Bhagavat, “in the past, in a time gone by, there was a king of a land, and his name was Mahāratha.

source: བང་མཛོད་རྒྱས་པ། དམག་གི་དཔུང་རབ་ཏུ་དཔའ་བ།
en: He was very rich, with great wealth, vast treasuries, and a courageous army.

source: མང་པོ་ཀུན་གྱིས་བཀུར་ཞིང་ངག་ཉན་པ། རྟག་པར་ཡང་དག་པའི་ཆོས་ཀྱིས་སྐྱེ་བོ་འདུལ་བ།
en: He was honored and obeyed by the entire multitude of people, and he constantly guided them through the Dharma.

source: མི་རྣམས་དར་ཞིང་རྒྱས་པ། ཕྱིར་རྒོལ་བའི་དགྲ་མེད་པ་ཞིག་ཡོད་དེ།
en: The people had multiplied and spread, and he had no opposing enemies.

source: བཙུན་མོ་དམ་པ་བྱད་བཞིན་ཤིན་ཏུ་སྡུག་ཅིང་མཛེས་པ།
en: His principal queen was extremely attractive and beautiful.

source: མང་པོ་ཀུན་གྱིས་བལྟ་བར་མོས་པའི་བུ་གསུམ་ཡོད་དེ།
en: He had three sons whom everyone wished to see.

source: བུ་ཆེན་པོའི་མིང་ནི་སྒྲ་ཆེན་པོ་ཞེས་བྱའོ།
en: The name of the eldest son was Mahāpraṇāda.

source: །བུ་འབྲིང་པོའི་མིང་ནི་ལྷ་ཆེན་པོ་ཞེས་བྱའོ།
en: The name of the middle son was Mahādeva.

source: །བུ་ཐ་ཆུངས་ཀྱི་མིང་ནི་སེམས་ཅན་ཆེན་པོ་ཞེས་བྱའོ།
en: The name of the youngest son was Mahāsattva. “

source: །དེའི་ཚེ་རྒྱལ་པོ་ཆེན་པོ་དེ་རྩེ་ཞིང་ལྟད་མོ་བལྟ་བའི་ཕྱིར་རི་དང་ནགས་ཚལ་ཀུན་དུ་བལྟ་བར་ཆས་པ་དང་།
en: At that time, the great king, to amuse himself and enjoy the view, set off to look at the mountains and forests.

source: བུ་གསུམ་པོ་དེ་ཡང་ཕྱི་བཞིན་དུ་དོང་ངོ་།
en: The three sons also departed, following him.

source: །མེ་ཏོག་དང་འབྲས་བུ་བཙལ་བའི་ཕྱིར་ཕ་སྤངས་ཏེ་ཀུན་དུ་འཁྱམ་པ་ལས་འོད་མའི་ཚལ་ཆེན་པོ་ཞིག་ཏུ་ཕྱིན་ཏེ་ངལ་བསོས་སོ།
en: In order to search for flowers and fruits, they left their father and wandered. Then they entered a great forest of bamboos to rest. “

source: །དེ་ནས་རྒྱལ་བུ་ཆེན་པོས་འདི་སྐད་དུ་དེང་བདག་ནི་སེམས་སྐྲག་ཅིང་འཇིགས་པར་གྱུར་ན།
en: Then the eldest prince said, ‘I am scared and frightened now!

source: ནགས་ཚལ་འདིར་གཅན་གཟན་མ་རུངས་པ་དག་གིས་བདག་ཅག་གསོད་པར་མི་འགྱུར་རམ་ཞེས་སྨྲས་སོ།
en: Might not a vicious wild beast kill us in this forest?’ “

source: །རྒྱལ་བུ་འབྲིང་པོས་ཡང་འདི་སྐད་དུ་བདག་ནི་རང་གི་ལུས་ལ་དང་པོ་ནས་ཕངས་པ་མེད་ན་སྙིང་དུ་སྡུག་པ་འདི་དང་འབྲལ་བའི་སྡུག་བསྔལ་ཞིང་འབྱུང་དུ་དོགས་སོ་ཞེས་སྨྲས་སོ།
en: The middle prince said, ‘I am worried that if I start out with having no concern for my own body, I will experience the suffering of losing this beloved body.’ “

source: །རྒྱལ་བུ་ཐ་ཆུངས་ཀྱིས་ཕོ་བོ་གཉིས་ལ་སྨྲས་པ། །འདི་ནི་ལྷ་དང་དྲང་སྲོང་འདུ་བའི་གནས།
en: The youngest prince then said to his two older brothers: “ ‘This is a place where the devas and ṛṣis gather.

source: །བདག་ལ་འཇིགས་དངངས་འབྲལ་བའི་མྱ་ངན་མེད།
en: I am not miserable and have no fear or terror.

source: །ལུས་སེམས་ཀུན་ཁྱབ་དགའ་བ་སྐྱེས་པས་ན། །ཁྱད་པར་འཕགས་པའི་ཡོན་ཏན་འཐོབ་པར་འགྱུར།
en: My body and mind are filled with happiness, And therefore I will gain superior qualities.’ “

source: །དེའི་ཚེ་རྒྱལ་བུ་རྣམས་སོ་སོ་ནས་རང་གི་སེམས་ལ་ཅི་བསམས་པའི་དངོས་པོ་དག་སྨྲས་ནས་མཐར་གྱིས་མདུན་དུ་དོང་བ་ལས་སྟག་མོ་ཞིག་བུ་བདུན་བཙས་ནས་ཞག་བདུན་ལོན་པ་བུ་རྣམས་ཀྱིས་བསྐོར་བ།
en: At that time, the princes each spoke what was in their minds, and they eventually continued onward until they saw a tigress who had given birth to five cubs seven days earlier.

source: བཀྲེས་པ་དང་སྐོམ་པ་དག་གིས་རབ་ཏུ་གཟིར་བ། ལུས་རིད་ཅིང་ཉམ་ཆུང་བ་རིང་པོ་མི་ཐོགས་པར་འཆི་བར་འགྱུར་བ་ཞིག་མཐོང་བ་དང་།
en: She was encircled by her cubs and tormented by hunger and thirst; her body was thin and weak, and she would soon die. “

source: རྒྱལ་བུ་ཆེན་པོས་འདི་སྐད་དུ་ཀྱེ་མ་སྟག་མོ་འདི་ནི་བུ་བཙས་ནས་ཞག་བདུན་ལོན་ཏེ།
en: The eldest prince said, ‘Alas, this tigress gave birth to cubs seven days ago.

source: བུ་བདུན་གྱིས་ཡོངས་སུ་བསྐོར་བས་ཟས་བཙལ་ཡང་མི་ཁོམ་སྟེ།
en: Because she is encircled by her cubs, she has not been free to seek food.

source: བཀྲེས་པ་དང་སྐོམ་པ་དག་གིས་རབ་ཏུ་གཟིར་བས་གདོན་མི་ཟ་བར་བུ་རྣམས་ཟ་བར་འགྱུར་རོ་ཞེས་སྨྲས་སོ། །རྒྱལ་བུ་སེམས་ཅན་ཆེན་པོས་སྨྲས་པ།
en: She is so tormented by hunger and thirst she will no doubt eat her own cubs.’ “ ‘

source: སྟག་འདི་དག་རྟག་པར་ཟས་ཇི་ལྟ་བུ་ཞིག་ཟ།
en: What does this tigress usually eat?’

source: རྒྱལ་བུ་ཆེན་པོས་སྨྲས་པ།
en: asked Prince Mahāsattva. “

source: སྟག་དང་སེང་གེ་འཕར་སྤྱང་རྣམས། །ཤ་ཁྲག་དྲོན་མོ་འབའ་ཞིག་ཟ།
en: The eldest prince answered: “ ‘Tigers, lions, jackals, and wolves Eat nothing but flesh and warm blood.

source: །དེ་ལས་གཞན་པའི་ཟས་སྐོམ་གྱིས། །འདི་ཡི་ཉམ་ཆུང་སེལ་མི་ནུས།
en: Any other kind of food than that Will fail to dispel her weakness.’ “

source: །རྒྱལ་བུ་འབྲིང་པོས་དེ་སྐད་སྨྲས་པ་ཐོས་པ་དང་འདི་སྐད་ཅེས་སྨྲས་སོ། །སྟག་མོ་འདི་ནི་རིད་ཅིང་ཉམ་ཆུང་ལ་བཀྲེས་སྐོམ་གྱིས་ཉོན་མོངས་པས་སྲོག་གི་ལྷག་མ་ཆུང་ཟད་ཙམ་ཞིག་ལུས་ན།
en: The middle prince said, ‘This tigress is so thin and weak and tormented by hunger and thirst that she only has a little life left.

source: བདག་ཅག་གིས་ཇི་ལྟར་འདི་ལྟར་རྙེད་པར་དཀའ་བའི་ཟས་དང་སྐོམ་བཙལ་བར་ནུས།
en: How could we seek that kind of food and drink, which is difficult to find?

source: སུ་ཞིག་ནི་འདི་དག་གི་ཆེད་དུ་རང་གི་ལུས་དང་སྲོག་སྤངས་ནས་བཀྲེས་པ་དང་སྐོམ་པའི་སྡུག་བསྔལ་སེལ་བར་བྱེད། རྒྱལ་བུ་ཆེན་པོས་སྨྲས་པ།
en: Who for their sake would give up their own body and life to dispel their hunger and thirst?’ “ ‘

source: སྤང་བར་དཀའ་བ་ཐམས་ཅད་ཀྱི་ནང་ན་བདག་གི་ལུས་ལས་ལྷག་པ་གང་ཡང་མེད་དོ།
en: There is nothing that is more difficult to give up than one’s own body!’

source: །རྒྱལ་བུ་སེམས་ཅན་ཆེན་པོས་སྨྲས་པ།
en: said the eldest prince. “

source: དེང་བདག་ཅག་ནི་སོ་སོ་ནས་རང་གི་ལུས་ལ་སྲེད་ཅིང་མངོན་པར་ཞེན་པ་དང་། ཤེས་རབ་མེད་པས་གཞན་ལ་ཕན་འདོགས་པར་མི་ནུས་ཀྱི།
en: Prince Mahāsattva said, ‘At this time, each of us has clinging and attachment to our bodies; we have no wisdom and are unable to benefit others.

source: སྐྱེས་བུ་དམ་པ་དག་ནི་སྙིང་རྗེ་ཆེན་པོའི་སེམས་དང་ལྡན་པས་རྟག་པར་གཞན་ལ་ཕན་གདགས་པའི་ཕྱིར་རང་གི་ལུས་ཁྱད་དུ་བསད་ནས་སེམས་ཅན་རྣམས་ལ་ཕན་འདོགས་པར་བྱེད་དོ།
en: Supreme beings have minds of great compassion, and in order to constantly benefit others are indifferent to their bodies, and this benefits beings.’ “

source: །གཞན་ཡང་འདི་སྙམ་དུ་བདག་གི་ལུས་འདི་ནི་ཚེ་རབས་བརྒྱ་སྟོང་དུ་མའི་བར་དུ་དོན་མེད་པར་རུལ་ཅིང་མྱགས་ཏེ་བོར་བས་ཕན་པ་ཅི་ཡང་བྱས་པ་མེད་ན།
en: He also thought, ‘For many hundreds of thousands of lifetimes, my body has rotted and decayed and been lost meaninglessly without causing any benefit whatsoever.

source: ཅིའི་ཕྱིར་དེང་མཆིལ་སྣབས་བཞིན་དུ་ཡོངས་སུ་སྤངས་ནས་བཀྲེས་པ་དག་གིས་ཉེན་པའི་སྡུག་བསྔལ་སེལ་བར་མི་བྱེད་སྙམ་མོ།
en: Why should I not cast it away this time like saliva or mucus and dispel the suffering of those pained by hunger?’ “

source: །དེའི་ཚེ་རྒྱལ་བུ་དེ་དག་ཚིག་དེ་ལྟ་བུ་དག་སྨྲས་ནས་སོ་སོ་ནས་བྱམས་ཤིང་བརྩེ་བའི་སེམས་བསྐྱེད་དེ། སྟག་མོ་ཉམ་ཆུང་བ་དེ་ལ་མིག་མི་གཡེང་བར་བལྟས་ནས་རིང་ཞིག་ཏུ་བསྐོར་ཏེ་ཅིག་ཆར་སྤངས་ནས་དོང་ངོ་།
en: At that time the princes, having thus spoken their thoughts, each felt love and pity, and without taking their eyes off the tigress, they circled her from a distance and then together left her and went away. “

source: །དེ་ནས་རྒྱལ་བུ་སེམས་ཅན་ཆེན་པོ་འདི་སྙམ་དུ་བདག་གིས་ལུས་དང་སྲོག་བཏང་བའི་དུས་ནི་དེང་ཡིན་ཏེ།
en: Then Mahāsattva thought, ‘Now is the time for me to give away my body and life.

source: བདག་གིས་ཡུན་རིང་ལུས་འདི་རབ་བཟུང་ཡང་། །མི་གཙང་མནམ་ལ་རྣག་འཛག་ཡིད་མི་འོང་།
en: For a long time I have taken care of this body, Which is dirty, smelly, drips with pus, and is disgusting.

source: །ཡོ་བྱད་གོས་ཟས་ཤིང་རྟ་གླང་པོ་རྟ། །ནོར་དང་རིན་ཆེན་རིམ་གྲོ་བྱས་ཀྱང་ནི། །འགྱུར་ཞིང་འཇིག་ཆོས་ངོ་བོ་ཉིད་མི་རྟག །རྟག་ཚོལ་དགང་དཀའ་བསྲུང་བར་རབ་ཏུ་དཀའ།
en: I have served it with necessities, food, clothes, Carriages, elephants, horses, wealth, and jewels, “ ‘But it will change and be destroyed; its nature is impermanent, Always searching, difficult to fulfill, difficult to protect.

source: །རྟག་ཏུ་མཆོད་ཅིང་རིམ་གྲོ་བྱས་ཀྱང་ནི། །ནམས་ཀྱང་བདག་འདོར་བྱས་པའི་དྲིན་མི་ཤེས།
en: Even though it has been continually offered to and served, It has always abandoned me and shows no gratitude.’ “

source: །གཞན་ཡང་ལུས་འདི་ནི་མི་བརྟན་པས་བདག་ལ་ཕན་པ་མེད་པ།
en: He thought, ‘Moreover, this body is unstable and of no benefit to me.

source: འཇིགས་སུ་རུང་བས་དགྲ་དང་འདྲ་བ།
en: It is terrifying like an enemy.

source: མི་གཙང་བས་ལུད་དང་མཚུངས་པ་ཡིན་པས།
en: It is impure like feces.

source: དེང་བདག་གི་ལུས་འདིས་ཡངས་ཤིང་རྒྱ་ཆེ་བའི་ལས་མངོན་པར་བསྒྲུབས་ནས་སྐྱེ་ཤིའི་རྒྱ་མཚོར་གྲུ་གཟིངས་ཆེན་པོ་བྱས་ཏེ།
en: Today, with this body, I will accomplish a vast, immense action and make it into a great ship that will cross the ocean of birth and death.

source: འཁོར་བ་ཡོངས་སུ་སྤངས་ནས་ངེས་པར་འབྱུང་བ་ཐོབ་པར་བྱའོ་སྙམ་མོ།
en: I will abandon saṃsāra and certainly accomplish leaving it behind.’ “

source: །གཞན་ཡང་འདི་སྙམ་དུ་གལ་ཏེ་ལུས་འདི་སྤངས་པར་གྱུར་ན་འདི་ཉིད་འབྲས་དང་། ནད་མ་རུངས་པ་ཚད་མེད་པ་དང་། འཇིགས་ཤིང་སྐྲག་པ་བརྒྱ་སྟོང་དུ་མ་སྤངས་པ་ཡིན་ནོ།
en: He also thought, ‘In abandoning this body, I will be abandoning boils, countless dreadful illnesses, and many hundreds of thousands of terrors and fears.

source: །ལུས་འདི་ནི་བཤང་གཅི་འབའ་ཞིག་དང་ལྡན་པ།
en: This body contains nothing but urine and feces.

source: ཆུ་བུར་ལྟ་བུར་མི་བརྟན་པ།
en: It is as unstable as a water bubble.

source: སྲིན་བུ་མང་པོ་འདུས་པ།
en: It is a congregation of many worms.

source: རྩ་རྒྱུས་དང་རུས་པ་ཕན་ཚུན་འབྲེལ་པ།
en: It is a web of veins and muscles.

source: ཤིན་ཏུ་ཡོངས་སུ་སྐྱོ་བར་བྱ་བ།
en: It causes disgust.

source: ཉེས་དམིགས་དང་བཅས་པ་ཡིན་པས་དེའི་ཕྱིར་དེང་བདག་གིས་ལུས་ཡོངས་སུ་སྤངས་ནས་བླ་ན་མེད་པ་མཐར་ཕྱིན་པའི་མྱ་ངན་ལས་འདས་པ་ཡོངས་སུ་བཙལ་ཏེ།
en: It is disadvantageous. Therefore, I will abandon this body today and seek the highest, ultimate nirvāṇa.

source: མྱ་ངན་གྱི་ཉེས་པ་དང་། མི་རྟག་པའི་སྡུག་བསྔལ་དང་། འཁྲུག་པ་གཏན་དུ་སྤངས་ནས་འཁོར་བ་རྒྱུན་བཅད་དེ།
en: Completely abandoning the fault of misery, the suffering of impermanence, and distress, I will end the continuity of saṃsāra.

source: ཉེས་པ་རྣམས་སྤངས་ནས་ཏིང་ངེ་འཛིན་དང་། ཤེས་རབ་ཀྱི་སྟོབས་ཀྱིས་ཕུན་སུམ་ཚོགས་པར་བསྒོམས་ནས་བསོད་ནམས་བརྒྱ་སྟོང་མང་པོས་བརྒྱན་པ། ཐམས་ཅད་མཁྱེན་པར་གྱུར་པ། སངས་རྒྱས་མང་པོས་རབ་ཏུ་བསྔགས་པའི་ཆོས་ཀྱི་སྐུ་ཤིན་ཏུ་གྱ་ནོམ་པ་འཐོབ་པར་བྱའོ།
en: Eliminating all faults, through the power of samādhi and wisdom I will meditate perfectly and attain the Dharma body that is adorned by many hundreds of thousands of merits, is omniscient, and is praised by the multitudes of buddhas.

source: །ཐོབ་པར་གྱུར་ནས་ཀྱང་སེམས་ཅན་རྣམས་ལ་ཆོས་ཀྱིས་སྨན་ཚད་མེད་པ་གཏང་བར་བྱའོ་སྙམ་མོ།
en: Having attained that, I will bring immeasurable benefit to beings through the Dharma.’ “

source: །དེའི་ཚེ་རྒྱལ་བུ་དེ་ཤིན་ཏུ་བརྟུལ་བའི་དཔའ་སྲན་དང་། སྨོན་ལམ་ཆེན་པོ་བཏབ་ནས་སྙིང་རྗེ་ཆེན་པོའི་བསམ་པས་སེམས་རྟས་ཤིང་འཕེལ་པར་གྱུར་ཀྱང་ཕུ་བོ་གཉིས་སྐྲག་ཅིང་དངངས་པས་བར་ཆད་ཀྱི་བགེགས་བྱས་ནས་སྨོན་པ་མི་འགྲུབ་པར་དོགས་པས།
en: At that time, the prince, making a great prayer with great courageous self-control, had made his motivation grow with thoughts of great compassion, but he was worried that his two elder brothers, being frightened and terrified, would cause a hindering obstacle so that he would not be able to accomplish his aspiration.
